# 現在の機能一覧のメモみたいなもの
def main(msg):
  result = ("現在の機能一覧だよ。\n\n"
            "・凸数管理機能\n"
            "　　定時に送られるメッセージに対するリアクションにより凸管理\n"
            "・凸数集計機能\n"
            "　　/countコマンドによる凸数集計\n"
            "・強制メッセージ送信機能\n"
            "　　/rebootコマンドにより強制的に凸管理用メッセージを送信。朝5時に来なかった場合の使用を想定\n"
            "・TL解析機能\n"
            "　　所定のチャンネルにYoutubeのURLを貼ることでTL解析\n"
            "・持ち越し計算機能\n"
            "　　持ち越し用TLをかんたん出力\n"
            "・おみくじ機能\n"
            "　　景気づけ\n"
            "・ママ機能\n"
            "　　忙しい日々に癒しを\n"
            "・困った機能\n"
            "　　さまさま\n\n"
            "追加予定の機能一覧だよ。\n\n"
            "・タスキル管理機能\n"
            "・介錯機能\n")

  return result
  
  
